// Function to generate fancy text using Unicode characters
    function fancyText(text, style) {
    const fancyStyles = {
    "boxed": {
    "A": "🄰", "B": "🄱", "C": "🄲", "D": "🄳", "E": "🄴", "F": "🄵", "G": "🄶", "H": "🄷", "I": "🄸", "J": "🄹", "K": "🄺", "L": "🄻", "M": "🄼", "N": "🄽", "O": "🄾", "P": "🄿", "Q": "🅀", "R": "🅁", "S": "🅂", "T": "🅃", "U": "🅄", "V": "🅅", "W": "🅆", "X": "🅇", "Y": "🅈", "Z": "🅉",
    "a": "🄰", "b": "🄱", "c": "🄲", "d": "🄳", "e": "🄴", "f": "🄵", "g": "🄶", "h": "🄷", "i": "🄸", "j": "🄹", "k": "🄺", "l": "🄻", "m": "🄼", "n": "🄽", "o": "🄾", "p": "🄿", "q": "🅀", "r": "🅁", "s": "🅂", "t": "🅃", "u": "🅄", "v": "🅅", "w": "🅆", "x": "🅇", "y": "🅈", "z": "🅉"
    },
    "full_boxed": {
    "A": "🅰", "B": "🅱", "C": "🅲", "D": "🅳", "E": "🅴", "F": "🅵", "G": "🅶", "H": "🅷", "I": "🅸", "J": "🅹", "K": "🅺", "L": "🅻", "M": "🅼", "N": "🅽", "O": "🅾", "P": "🅿", "Q": "🆀", "R": "🆁", "S": "🆂", "T": "🆃", "U": "🆄", "V": "🆅", "W": "🆆", "X": "🆇", "Y": "🆈", "Z": "🆉",
    "a": "🅰", "b": "🅱", "c": "🅲", "d": "🅳", "e": "🅴", "f": "🅵", "g": "🅶", "h": "🅷", "i": "🅸", "j": "🅹", "k": "🅺", "l": "🅻", "m": "🅼", "n": "🅽", "o": "🅾", "p": "🅿", "q": "🆀", "r": "🆁", "s": "🆂", "t": "🆃", "u": "🆄", "v": "🆅", "w": "🆆", "x": "🆇", "y": "🆈", "z": "🆉"
    },
    "monospace": {
    "A": "𝙰", "B": "𝙱", "C": "𝙲", "D": "𝙳", "E": "𝙴", "F": "𝙵", "G": "𝙶", "H": "𝙷", "I": "𝙸", "J": "𝙹", "K": "𝙺", "L": "𝙻", "M": "𝙼", "N": "𝙽", "O": "𝙾", "P": "𝙿", "Q": "𝚀", "R": "𝚁", "S": "𝚂", "T": "𝚃", "U": "𝚄", "V": "𝚅", "W": "𝚆", "X": "𝚇", "Y": "𝚈", "Z": "𝚉",
    "a": "𝚊", "b": "𝚋", "c": "𝚌", "d": "𝚍", "e": "𝚎", "f": "𝚏", "g": "𝚐", "h": "𝚑", "i": "𝚒", "j": "𝚓", "k": "𝚔", "l": "𝚕", "m": "𝚖", "n": "𝚗", "o": "𝚘", "p": "𝚙", "q": "𝚚", "r": "𝚛", "s": "𝚜", "t": "𝚝", "u": "𝚞", "v": "𝚟", "w": "𝚠", "x": "𝚡", "y": "𝚢", "z": "𝚣"
    },
    "cutout": {
    "A": "𝔸", "B": "𝔹", "C": "ℂ", "D": "𝔻", "E": "𝔼", "F": "𝔽", "G": "𝔾", "H": "ℍ", "I": "𝕀", "J": "𝕁", "K": "𝕂", "L": "𝕃", "M": "𝕄", "N": "ℕ", "O": "𝕆", "P": "ℙ", "Q": "ℚ", "R": "ℝ", "S": "𝕊", "T": "𝕋", "U": "𝕌", "V": "𝕍", "W": "𝕎", "X": "𝕏", "Y": "𝕐", "Z": "ℤ",
    "a": "𝕒", "b": "𝕓", "c": "𝕔", "d": "𝕕", "e": "𝕖", "f": "𝕗", "g": "𝕘", "h": "𝕙", "i": "𝕚", "j": "𝕛", "k": "𝕜", "l": "𝕝", "m": "𝕞", "n": "𝕟", "o": "𝕠", "p": "𝕡", "q": "𝕢", "r": "𝕣", "s": "𝕤", "t": "𝕥", "u": "𝕦", "v": "𝕧", "w": "𝕨", "x": "𝕩", "y": "𝕪", "z": "𝕫"
    },
    "small_caps": {
    "A": "ᴀ", "B": "ʙ", "C": "ᴄ", "D": "ᴅ", "E": "ᴇ", "F": "ғ", "G": "ɢ", "H": "ʜ", "I": "ɪ", "J": "ᴊ", "K": "ᴋ", "L": "ʟ", "M": "ᴍ", "N": "ɴ", "O": "ᴏ", "P": "ᴘ", "Q": "ǫ", "R": "ʀ", "S": "s", "T": "ᴛ", "U": "ᴜ", "V": "ᴠ", "W": "ᴡ", "X": "x", "Y": "ʏ", "Z": "ᴢ",
    "a": "ᴀ", "b": "ʙ", "c": "ᴄ", "d": "ᴅ", "e": "ᴇ", "f": "ғ", "g": "ɢ", "h": "ʜ", "i": "ɪ", "j": "ᴊ", "k": "ᴋ", "l": "ʟ", "m": "ᴍ", "n": "ɴ", "o": "ᴏ", "p": "ᴘ", "q": "ǫ", "r": "ʀ", "s": "s", "t": "ᴛ", "u": "ᴜ", "v": "ᴠ", "w": "ᴡ", "x": "x", "y": "ʏ", "z": "ᴢ"
    },
    "old_english": {
    "A": "𝔄", "B": "𝔅", "C": "ℭ", "D": "𝔇", "E": "𝔈", "F": "𝔉", "G": "𝔊", "H": "ℌ", "I": "ℑ", "J": "𝔍", "K": "𝔎", "L": "𝔏", "M": "𝔐", "N": "𝔑", "O": "𝔒", "P": "𝔓", "Q": "𝔔", "R": "ℜ", "S": "𝔖", "T": "𝔗", "U": "𝔘", "V": "𝔙", "W": "𝔚", "X": "𝔛", "Y": "𝔜", "Z": "ℨ",
    "a": "𝔞", "b": "𝔟", "c": "𝔠", "d": "𝔡", "e": "𝔢", "f": "𝔣", "g": "𝔤", "h": "𝔥", "i": "𝔦", "j": "𝔧", "k": "𝔨", "l": "𝔩", "m": "𝔪", "n": "𝔫", "o": "𝔬", "p": "𝔭", "q": "𝔮", "r": "𝔯", "s": "𝔰", "t": "𝔱", "u": "𝔲", "v": "𝔳", "w": "𝔴", "x": "𝔵", "y": "𝔶", "z": "𝔷"
    },
    "old_english_bold": {
    "A": "𝕬", "B": "𝕭", "C": "𝕮", "D": "𝕯", "E": "𝕰", "F": "𝕱", "G": "𝕲", "H": "𝕳", "I": "𝕴", "J": "𝕵", "K": "𝕶", "L": "𝕷", "M": "𝕸", "N": "𝕹", "O": "𝕺", "P": "𝕻", "Q": "𝕼", "R": "𝕽", "S": "𝕾", "T": "𝕿", "U": "𝖀", "V": "𝖁", "W": "𝖂", "X": "𝖃", "Y": "𝖄", "Z": "𝖅",
    "a": "𝖆", "b": "𝖇", "c": "𝖈", "d": "𝖉", "e": "𝖊", "f": "𝖋", "g": "𝖌", "h": "𝖍", "i": "𝖎", "j": "𝖏", "k": "𝖐", "l": "𝖑", "m": "𝖒", "n": "𝖓", "o": "𝖔", "p": "𝖕", "q": "𝖖", "r": "𝖗", "s": "𝖘", "t": "𝖙", "u": "𝖚", "v": "𝖛", "w": "𝖜", "x": "𝖝", "y": "𝖞", "z": "𝖟"
    },
    "organic": {
    "A": "α", "B": "в", "C": "ς", "D": "∂", "E": "є", "F": "ғ", "G": "g", "H": "н", "I": "ι", "J": "נ", "K": "к", "L": "ℓ", "M": "м", "N": "η", "O": "σ", "P": "ρ", "Q": "q", "R": "я", "S": "ѕ", "T": "т", "U": "υ", "V": "v", "W": "ω", "X": "x", "Y": "у", "Z": "z",
    "a": "α", "b": "в", "c": "ς", "d": "∂", "e": "є", "f": "ғ", "g": "g", "h": "н", "i": "ι", "j": "נ", "k": "к", "l": "ℓ", "m": "м", "n": "η", "o": "σ", "p": "ρ", "q": "q", "r": "я", "s": "ѕ", "t": "т", "u": "υ", "v": "v", "w": "ω", "x": "x", "y": "у", "z": "z"
    },
    "script": {
    "A": "𝒜", "B": "𝐵", "C": "𝒞", "D": "𝒟", "E": "𝐸", "F": "𝐹", "G": "𝒢", "H": "𝐻", "I": "𝐼", "J": "𝒥", "K": "𝒦", "L": "𝐿", "M": "𝑀", "N": "𝒩", "O": "𝒪", "P": "𝒫", "Q": "𝒬", "R": "𝑅", "S": "𝒮", "T": "𝒯", "U": "𝒰", "V": "𝒱", "W": "𝒲", "X": "𝒳", "Y": "𝒴", "Z": "𝒵",
    "a": "𝒶", "b": "𝒷", "c": "𝒸", "d": "𝒹", "e": "𝑒", "f": "𝒻", "g": "𝑔", "h": "𝒽", "i": "𝒾", "j": "𝒿", "k": "𝓀", "l": "𝓁", "m": "𝓂", "n": "𝓃", "o": "ℴ", "p": "𝓅", "q": "𝓆", "r": "𝓇", "s": "𝓈", "t": "𝓉", "u": "𝓊", "v": "𝓋", "w": "𝓌", "x": "𝓍", "y": "𝓎", "z": "𝓏"
    },
    "bold_script": {
    "A": "𝓐", "B": "𝓑", "C": "𝓒", "D": "𝓓", "E": "𝓔", "F": "𝓕", "G": "𝓖", "H": "𝓗", "I": "𝓘", "J": "𝓙", "K": "𝓚", "L": "𝓛", "M": "𝓜", "N": "𝓝", "O": "𝓞", "P": "𝓟", "Q": "𝓠", "R": "𝓡", "S": "𝓢", "T": "𝓣", "U": "𝓤", "V": "𝓥", "W": "𝓦", "X": "𝓧", "Y": "𝓨", "Z": "𝓩",
    "a": "𝓪", "b": "𝓫", "c": "𝓬", "d": "𝓭", "e": "𝓮", "f": "𝓯", "g": "𝓰", "h": "𝓱", "i": "𝓲", "j": "𝓳", "k": "𝓴", "l": "𝓵", "m": "𝓶", "n": "𝓷", "o": "𝓸", "p": "𝓹", "q": "𝓺", "r": "𝓻", "s": "𝓼", "t": "𝓽", "u": "𝓾", "v": "𝓿", "w": "𝔀", "x": "𝔁", "y": "𝔂", "z": "𝔃"
    },
    "circles": {
    "A": "Ⓐ", "B": "Ⓑ", "C": "Ⓒ", "D": "Ⓓ", "E": "Ⓔ", "F": "Ⓕ", "G": "Ⓖ", "H": "Ⓗ", "I": "Ⓘ", "J": "Ⓙ", "K": "Ⓚ", "L": "Ⓛ", "M": "Ⓜ", "N": "Ⓝ", "O": "Ⓞ", "P": "Ⓟ", "Q": "Ⓠ", "R": "Ⓡ", "S": "Ⓢ", "T": "Ⓣ", "U": "Ⓤ", "V": "Ⓥ", "W": "Ⓦ", "X": "Ⓧ", "Y": "Ⓨ", "Z": "Ⓩ",
    "a": "ⓐ", "b": "ⓑ", "c": "ⓒ", "d": "ⓓ", "e": "ⓔ", "f": "ⓕ", "g": "ⓖ", "h": "ⓗ", "i": "ⓘ", "j": "ⓙ", "k": "ⓚ", "l": "ⓛ", "m": "ⓜ", "n": "ⓝ", "o": "ⓞ", "p": "ⓟ", "q": "ⓠ", "r": "ⓡ", "s": "ⓢ", "t": "ⓣ", "u": "ⓤ", "v": "ⓥ", "w": "ⓦ", "x": "ⓧ", "y": "ⓨ", "z": "ⓩ"
    },
    "filled_circles": {
    "A": "🅐", "B": "🅑", "C": "🅒", "D": "🅓", "E": "🅔", "F": "🅕", "G": "🅖", "H": "🅗", "I": "🅘", "J": "🅙", "K": "🅚", "L": "🅛", "M": "🅜", "N": "🅝", "O": "🅞", "P": "🅟", "Q": "🅠", "R": "🅡", "S": "🅢", "T": "🅣", "U": "🅤", "V": "🅥", "W": "🅦", "X": "🅧", "Y": "🅨", "Z": "🅩",
    "a": "🅐", "b": "🅑", "c": "🅒", "d": "🅓", "e": "🅔", "f": "🅕", "g": "🅖", "h": "🅗", "i": "🅘", "j": "🅙", "k": "🅚", "l": "🅛", "m": "🅜", "n": "🅝", "o": "🅞", "p": "🅟", "q": "🅠", "r": "🅡", "s": "🅢", "t": "🅣", "u": "🅤", "v": "🅥", "w": "🅦", "x": "🅧", "y": "🅨", "z": "🅩"
    },
    "wide": {
    "A": "Ａ", "B": "Ｂ", "C": "Ｃ", "D": "Ｄ", "E": "Ｅ", "F": "Ｆ", "G": "Ｇ", "H": "Ｈ", "I": "Ｉ", "J": "Ｊ", "K": "Ｋ", "L": "Ｌ", "M": "Ｍ", "N": "Ｎ", "O": "Ｏ", "P": "Ｐ", "Q": "Ｑ", "R": "Ｒ", "S": "Ｓ", "T": "Ｔ", "U": "Ｕ", "V": "Ｖ", "W": "Ｗ", "X": "Ｘ", "Y": "Ｙ", "Z": "Ｚ",
    "a": "ａ", "b": "ｂ", "c": "ｃ", "d": "ｄ", "e": "ｅ", "f": "ｆ", "g": "ｇ", "h": "ｈ", "i": "ｉ", "j": "ｊ", "k": "ｋ", "l": "ｌ", "m": "ｍ", "n": "ｎ", "o": "ｏ", "p": "ｐ", "q": "ｑ", "r": "ｒ", "s": "ｓ", "t": "ｔ", "u": "ｕ", "v": "ｖ", "w": "ｗ", "x": "ｘ", "y": "ｙ", "z": "ｚ"
    },
    "bold": {
    "A": "𝗔", "B": "𝗕", "C": "𝗖", "D": "𝗗", "E": "𝗘", "F": "𝗙", "G": "𝗚", "H": "𝗛", "I": "𝗜", "J": "𝗝", "K": "𝗞", "L": "𝗟", "M": "𝗠", "N": "𝗡", "O": "𝗢", "P": "𝗣", "Q": "𝗤", "R": "𝗥", "S": "𝗦", "T": "𝗧", "U": "𝗨", "V": "𝗩", "W": "𝗪", "X": "𝗫", "Y": "𝗬", "Z": "𝗭",
    "a": "𝗮", "b": "𝗯", "c": "𝗰", "d": "𝗱", "e": "𝗲", "f": "𝗳", "g": "𝗴", "h": "𝗵", "i": "𝗶", "j": "𝗷", "k": "𝗸", "l": "𝗹", "m": "𝗺", "n": "𝗻", "o": "𝗼", "p": "𝗽", "q": "𝗾", "r": "𝗿", "s": "𝘀", "t": "𝘁", "u": "𝘂", "v": "𝘃", "w": "𝘄", "x": "𝘅", "y": "𝘆", "z": "𝘇"
    },
    "bold_serif": {
    "A": "𝐀", "B": "𝐁", "C": "𝐂", "D": "𝐃", "E": "𝐄", "F": "𝐅", "G": "𝐆", "H": "𝐇", "I": "𝐈", "J": "𝐉", "K": "𝐊", "L": "𝐋", "M": "𝐌", "N": "𝐍", "O": "𝐎", "P": "𝐏", "Q": "𝐐", "R": "𝐑", "S": "𝐒", "T": "𝐓", "U": "𝐔", "V": "𝐕", "W": "𝐖", "X": "𝐗", "Y": "𝐘", "Z": "𝐙",
    "a": "𝐚", "b": "𝐛", "c": "𝐜", "d": "𝐝", "e": "𝐞", "f": "𝐟", "g": "𝐠", "h": "𝐡", "i": "𝐢", "j": "𝐣", "k": "𝐤", "l": "𝐥", "m": "𝐦", "n": "𝐧", "o": "𝐨", "p": "𝐩", "q": "𝐪", "r": "𝐫", "s": "𝐬", "t": "𝐭", "u": "𝐮", "v": "𝐯", "w": "𝐰", "x": "𝐱", "y": "𝐲", "z": "𝐳"
    },
    "italic": {
    "A": "𝘈", "B": "𝘉", "C": "𝘊", "D": "𝘋", "E": "𝘌", "F": "𝘍", "G": "𝘎", "H": "𝘏", "I": "𝘐", "J": "𝘑", "K": "𝘒", "L": "𝘓", "M": "𝘔", "N": "𝘕", "O": "𝘖", "P": "𝘗", "Q": "𝘘", "R": "𝘙", "S": "𝘚", "T": "𝘛", "U": "𝘜", "V": "𝘝", "W": "𝘞", "X": "𝘟", "Y": "𝘠", "Z": "𝘡",
    "a": "𝘢", "b": "𝘣", "c": "𝘤", "d": "𝘥", "e": "𝘦", "f": "𝘧", "g": "𝘨", "h": "𝘩", "i": "𝘪", "j": "𝘫", "k": "𝘬", "l": "𝘭", "m": "𝘮", "n": "𝘯", "o": "𝘰", "p": "𝘱", "q": "𝘲", "r": "𝘳", "s": "𝘴", "t": "𝘵", "u": "𝘶", "v": "𝘷", "w": "𝘸", "x": "𝘹", "y": "𝘺", "z": "𝘻"
    },
    "italic_serif": {
    "A": "𝐴", "B": "𝐵", "C": "𝐶", "D": "𝐷", "E": "𝐸", "F": "𝐹", "G": "𝐺", "H": "𝐻", "I": "𝐼", "J": "𝐽", "K": "𝐾", "L": "𝐿", "M": "𝑀", "N": "𝑁", "O": "𝑂", "P": "𝑃", "Q": "𝑄", "R": "𝑅", "S": "𝑆", "T": "𝑇", "U": "𝑈", "V": "𝑉", "W": "𝑊", "X": "𝑋", "Y": "𝑌", "Z": "𝑍",
    "a": "𝑎", "b": "𝑏", "c": "𝑐", "d": "𝑑", "e": "𝑒", "f": "𝑓", "g": "𝑔", "h": "𝑖", "i": "𝑖", "j": "𝑗", "k": "𝑘", "l": "𝑙", "m": "𝑚", "n": "𝑛", "o": "𝑜", "p": "𝑝", "q": "𝑞", "r": "𝑟", "s": "𝑠", "t": "𝑡", "u": "𝑢", "v": "𝑣", "w": "𝑤", "x": "𝑥", "y": "𝑦", "z": "𝑧"
    },
    "bold_italic": {
    "A": "𝘼", "B": "𝘽", "C": "𝘾", "D": "𝘿", "E": "𝙀", "F": "𝙁", "G": "𝙂", "H": "𝙃", "I": "𝙄", "J": "𝙅", "K": "𝙆", "L": "𝙇", "M": "𝙈", "N": "𝙉", "O": "𝙊", "P": "𝙋", "Q": "𝙌", "R": "𝙍", "S": "𝙎", "T": "𝙏", "U": "𝙐", "V": "𝙑", "W": "𝙒", "X": "𝙓", "Y": "𝙔", "Z": "𝙕",
    "a": "𝙖", "b": "𝙗", "c": "𝙘", "d": "𝙙", "e": "𝙚", "f": "𝙛", "g": "𝙜", "h": "𝙝", "i": "𝙞", "j": "𝙟", "k": "𝙠", "l": "𝙡", "m": "𝙢", "n": "𝙣", "o": "𝙤", "p": "𝙥", "q": "𝙦", "r": "𝙧", "s": "𝙨", "t": "𝙩", "u": "𝙪", "v": "𝙫", "w": "𝙬", "x": "𝙭", "y": "𝙮", "z": "𝙯"
    },
    "bold_italic_serif": {
    "A": "𝑨", "B": "𝑩", "C": "𝑪", "D": "𝑫", "E": "𝑬", "F": "𝑭", "G": "𝑮", "H": "𝑯", "I": "𝑰", "J": "𝑱", "K": "𝑲", "L": "𝑳", "M": "𝑴", "N": "𝑵", "O": "𝑶", "P": "𝑷", "Q": "𝑸", "R": "𝑹", "S": "𝑺", "T": "𝑻", "U": "𝑼", "V": "𝑽", "W": "𝑾", "X": "𝑿", "Y": "𝒀", "Z": "𝒁",
    "a": "𝒂", "b": "𝒃", "c": "𝒄", "d": "𝒅", "e": "𝒆", "f": "𝒇", "g": "𝒈", "h": "𝒉", "i": "𝒊", "j": "𝒋", "k": "𝒌", "l": "𝒍", "m": "𝒎", "n": "𝒏", "o": "𝒐", "p": "𝒑", "q": "𝒒", "r": "𝒓", "s": "𝒔", "t": "𝒕", "u": "𝒖", "v": "𝒗", "w": "𝒘", "x": "𝒙", "y": "𝒚", "z": "𝒛"
    },
    "underlined": {
    "A": "A͟", "B": "B͟", "C": "C͟", "D": "D͟", "E": "E͟", "F": "F͟", "G": "G͟", "H": "H͟", "I": "I͟", "J": "J͟", "K": "K͟", "L": "L͟", "M": "M͟", "N": "N͟", "O": "O͟", "P": "P͟", "Q": "Q͟", "R": "R͟", "S": "S͟", "T": "T͟", "U": "U͟", "V": "V͟", "W": "W͟", "X": "X͟", "Y": "Y͟", "Z": "Z͟",
    "a": "a͟", "b": "b͟", "c": "c͟", "d": "d͟", "e": "e͟", "f": "f͟", "g": "g͟", "h": "h͟", "i": "i͟", "j": "j͟", "k": "k͟", "l": "l͟", "m": "m͟", "n": "n͟", "o": "o͟", "p": "p͟", "q": "q͟", "r": "r͟", "s": "s͟", "t": "t͟", "u": "u͟", "v": "v͟", "w": "w͟", "x": "x͟", "y": "y͟", "z": "z͟"
    },
    "strikeout": {
    "A": "A̶", "B": "B̶", "C": "C̶", "D": "D̶", "E": "E̶", "F": "F̶", "G": "G̶", "H": "H̶", "I": "I̶", "J": "J̶", "K": "K̶", "L": "L̶", "M": "M̶", "N": "N̶", "O": "O̶", "P": "P̶", "Q": "Q̶", "R": "R̶", "S": "S̶", "T": "T̶", "U": "U̶", "V": "V̶", "W": "W̶", "X": "X̶", "Y": "Y̶", "Z": "Z̶",
    "a": "a̶", "b": "b̶", "c": "c̶", "d": "d̶", "e": "e̶", "f": "f̶", "g": "g̶", "h": "h̶", "i": "i̶", "j": "j̶", "k": "k̶", "l": "l̶", "m": "m̶", "n": "n̶", "o": "o̶", "p": "p̶", "q": "q̶", "r": "r̶", "s": "s̶", "t": "t̶", "u": "u̶", "v": "v̶", "w": "w̶", "x": "x̶", "y": "y̶", "z": "z̶"
    },
    "upsidedown": {
    "A": "∀", "B": "𐐒", "C": "Ↄ", "D": "◖", "E": "Ǝ", "F": "Ⅎ", "G": "⅁", "H": "H", "I": "I", "J": "ſ", "K": "⋊", "L": "˥", "M": "W", "N": "N", "O": "O", "P": "Ԁ", "Q": "Ό", "R": "ᴚ", "S": "S", "T": "⊥", "U": "∩", "V": "Λ", "W": "M", "X": "X", "Y": "⅄", "Z": "Z",
    "a": "ɐ", "b": "q", "c": "ɔ", "d": "p", "e": "ǝ", "f": "ɟ", "g": "ƃ", "h": "ɥ", "i": "ᴉ", "j": "ɾ", "k": "ʞ", "l": "ן", "m": "ɯ", "n": "u", "o": "o", "p": "d", "q": "b", "r": "ɹ", "s": "s", "t": "ʇ", "u": "n", "v": "ʌ", "w": "ʍ", "x": "x", "y": "ʎ", "z": "z"
    },
    "mirrored": {
    "A": "A", "B": "𐐒", "C": "Ↄ", "D": "ᗡ", "E": "Ǝ", "F": "Ⅎ", "G": "⅁", "H": "H", "I": "I", "J": "ſ", "K": "⋊", "L": "⅃", "M": "W", "N": "ᴎ", "O": "O", "P": "Ԁ", "Q": "Ό", "R": "ᴚ", "S": "S", "T": "⊥", "U": "∩", "V": "Λ", "W": "M", "X": "X", "Y": "⅄", "Z": "Z",
    "a": "ɒ", "b": "d", "c": "ɔ", "d": "b", "e": "ɘ", "f": "ʇ", "g": "ǫ", "h": "ʜ", "i": "i", "j": "ɿ", "k": "ʞ", "l": "ʃ", "m": "ɯ", "n": "ᴎ", "o": "o", "p": "q", "q": "p", "r": "ᴙ", "s": "s", "t": "ʇ", "u": "ᴜ", "v": "ᴠ", "w": "ʍ", "x": "x", "y": "ʏ", "z": "z"
    },
    "supertiny": {
    "A": "ᵃ", "B": "ᵇ", "C": "ᶜ", "D": "ᵈ", "E": "ᵉ", "F": "ᶠ", "G": "ᵍ", "H": "ʰ", "I": "ⁱ", "J": "ʲ", "K": "ᵏ", "L": "ˡ", "M": "ᵐ", "N": "ⁿ", "O": "ᵒ", "P": "ᵖ", "Q": "ᑫ", "R": "ʳ", "S": "ˢ", "T": "ᵗ", "U": "ᵘ", "V": "ᵛ", "W": "ʷ", "X": "ˣ", "Y": "ʸ", "Z": "ᶻ",
    "a": "ᵃ", "b": "ᵇ", "c": "ᶜ", "d": "ᵈ", "e": "ᵉ", "f": "ᶠ", "g": "ᵍ", "h": "ʰ", "i": "ⁱ", "j": "ʲ", "k": "ᵏ", "l": "ˡ", "m": "ᵐ", "n": "ⁿ", "o": "ᵒ", "p": "ᵖ", "q": "ᑫ", "r": "ʳ", "s": "ˢ", "t": "ᵗ", "u": "ᵘ", "v": "ᵛ", "w": "ʷ", "x": "ˣ", "y": "ʸ", "z": "ᶻ"
    },
    "flag": {
    "A": "🇦", "B": "🇧", "C": "🇨", "D": "🇩", "E": "🇪", "F": "🇫", "G": "🇬", "H": "🇭", "I": "🇮", "J": "🇯", "K": "🇰", "L": "🇱", "M": "🇲", "N": "🇳", "O": "🇴", "P": "🇵", "Q": "🇶", "R": "🇷", "S": "🇸", "T": "🇹", "U": "🇺", "V": "🇻", "W": "🇼", "X": "🇽", "Y": "🇾", "Z": "🇿",
    "a": "🇦", "b": "🇧", "c": "🇨", "d": "🇩", "e": "🇪", "f": "🇫", "g": "🇬", "h": "🇭", "i": "🇮", "j": "🇯", "k": "🇰", "l": "🇱", "m": "🇲", "n": "🇳", "o": "🇴", "p": "🇵", "q": "🇶", "r": "🇷", "s": "🇸", "t": "🇹", "u": "🇺", "v": "🇻", "w": "🇼", "x": "🇽", "y": "🇾", "z": "🇿"
    },
    "zalgo": {
    "A": "Ä̶̛̰̦̹͑͂̿̐̈́̓͘̕͟", "B": "B̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "C": "C̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "D": "D̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "E": "Ḛ̶̛̦̹̈͑͂̿̐̈́̓͘̕͟", "F": "F̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "G": "G̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "H": "Ḧ̶̛̰̦̹͑͂̿̐̈́̓͘̕͟", "I": "Ḭ̶̛̦̹̈͑͂̿̐̈́̓͘̕͟", "J": "J̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "K": "K̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "L": "L̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "M": "M̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "N": "N̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "O": "Ơ̶̰̦̹̈͑͂̿̐̈́̓͘̕͟", "P": "P̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "Q": "Q̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "R": "R̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "S": "S̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "T": "T̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "U": "Ư̶̰̦̹̈͑͂̿̐̈́̓͘̕͟", "V": "V̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "W": "Ẅ̶̛̰̦̹͑͂̿̐̈́̓͘̕͟", "X": "Ẍ̶̛̰̦̹͑͂̿̐̈́̓͘̕͟", "Y": "Ÿ̶̛̰̦̹͑͂̿̐̈́̓͘̕͟", "Z": "Z̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟",
    "a": "ä̶̛̰̦̹͑͂̿̐̈́̓͘̕͟", "b": "b̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "c": "c̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "d": "d̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "e": "ḛ̶̛̦̹̈͑͂̿̐̈́̓͘̕͟", "f": "f̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "g": "g̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "h": "ḧ̶̛̰̦̹͑͂̿̐̈́̓͘̕͟", "i": "ḭ̶̛̦̹̈͑͂̿̐̈́̓͘̕͟", "j": "j̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "k": "k̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "l": "l̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "m": "m̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "n": "n̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "o": "ơ̶̰̦̹̈͑͂̿̐̈́̓͘̕͟", "p": "p̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "q": "q̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "r": "r̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "s": "s̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "t": "ẗ̶̛̰̦̹͑͂̿̐̈́̓͘̕͟", "u": "ư̶̰̦̹̈͑͂̿̐̈́̓͘̕͟", "v": "v̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟", "w": "ẅ̶̛̰̦̹͑͂̿̐̈́̓͘̕͟", "x": "ẍ̶̛̰̦̹͑͂̿̐̈́̓͘̕͟", "y": "ÿ̶̛̰̦̹͑͂̿̐̈́̓͘̕͟", "z": "z̶̛̰̦̹̈͑͂̿̐̈́̓͘̕͟"
    },
    "doubledots": {
    "A": "Ȃ̇̈", "B": "B̑̇̈", "C": "C̑̇̈", "D": "D̑̇̈", "E": "Ȇ̇̈", "F": "F̑̇̈", "G": "G̑̇̈", "H": "H̑̇̈", "I": "Ȋ̇̈", "J": "J̑̇̈", "K": "K̑̇̈", "L": "L̑̇̈", "M": "M̑̇̈", "N": "N̑̇̈", "O": "Ȏ̇̈", "P": "P̑̇̈", "Q": "Q̑̇̈", "R": "Ȓ̇̈", "S": "S̑̇̈", "T": "T̑̇̈", "U": "Ȗ̇̈", "V": "V̑̇̈", "W": "W̑̇̈", "X": "X̑̇̈", "Y": "Y̑̇̈", "Z": "Z̑̇̈",
    "a": "ȃ̇̈", "b": "b̑̇̈", "c": "c̑̇̈", "d": "d̑̇̈", "e": "ȇ̇̈", "f": "f̑̇̈", "g": "g̑̇̈", "h": "h̑̇̈", "i": "ȋ̇̈", "j": "j̑̇̈", "k": "k̑̇̈", "l": "l̑̇̈", "m": "m̑̇̈", "n": "n̑̇̈", "o": "ȏ̇̈", "p": "p̑̇̈", "q": "q̑̇̈", "r": "ȓ̇̈", "s": "s̑̇̈", "t": "t̑̇̈", "u": "ȗ̇̈", "v": "v̑̇̈", "w": "w̑̇̈", "x": "x̑̇̈", "y": "y̑̇̈", "z": "z̑̇̈"
    },
    "circumflex": {
    "A": "A̐̈", "B": "B̐̈", "C": "C̐̈", "D": "D̐̈", "E": "E̐̈", "F": "F̐̈", "G": "G̐̈", "H": "H̐̈", "I": "I̐̈", "J": "J̐̈", "K": "K̐̈", "L": "L̐̈", "M": "M̐̈", "N": "N̐̈", "O": "O̐̈", "P": "P̐̈", "Q": "Q̐̈", "R": "R̐̈", "S": "S̐̈", "T": "T̐̈", "U": "U̐̈", "V": "V̐̈", "W": "W̐̈", "X": "X̐̈", "Y": "Y̐̈", "Z": "Z̐̈",
    "a": "a̐̈", "b": "b̐̈", "c": "c̐̈", "d": "d̐̈", "e": "e̐̈", "f": "f̐̈", "g": "g̐̈", "h": "h̐̈", "i": "i̐̈", "j": "j̐̈", "k": "k̐̈", "l": "l̐̈", "m": "m̐̈", "n": "n̐̈", "o": "o̐̈", "p": "p̐̈", "q": "q̐̈", "r": "r̐̈", "s": "s̐̈", "t": "t̐̈", "u": "u̐̈", "v": "v̐̈", "w": "w̐̈", "x": "x̐̈", "y": "y̐̈", "z": "z̐̈"
    },
    "wave": {
    "A": "A͛", "B": "B͛", "C": "C͛", "D": "D͛", "E": "E͛", "F": "F͛", "G": "G͛", "H": "H͛", "I": "I͛", "J": "J͛", "K": "K͛", "L": "L͛", "M": "M͛", "N": "N͛", "O": "O͛", "P": "P͛", "Q": "Q͛", "R": "R͛", "S": "S͛", "T": "T͛", "U": "U͛", "V": "V͛", "W": "W͛", "X": "X͛", "Y": "Y͛", "Z": "Z͛",
    "a": "a͛", "b": "b͛", "c": "c͛", "d": "d͛", "e": "e͛", "f": "f͛", "g": "g͛", "h": "h͛", "i": "i͛", "j": "j͛", "k": "k͛", "l": "l͛", "m": "m͛", "n": "n͛", "o": "o͛", "p": "p͛", "q": "q͛", "r": "r͛", "s": "s͛", "t": "t͛", "u": "u͛", "v": "v͛", "w": "w͛", "x": "x͛", "y": "y͛", "z": "z͛"
    },
    "slashed": {
    "A": "A̸", "B": "B̸", "C": "C̸", "D": "D̸", "E": "E̸", "F": "F̸", "G": "G̸", "H": "H̸", "I": "I̸", "J": "J̸", "K": "K̸", "L": "L̸", "M": "M̸", "N": "N̸", "O": "O̸", "P": "P̸", "Q": "Q̸", "R": "R̸", "S": "S̸", "T": "T̸", "U": "U̸", "V": "V̸", "W": "W̸", "X": "X̸", "Y": "Y̸", "Z": "Z̸",
    "a": "a̸", "b": "b̸", "c": "c̸", "d": "d̸", "e": "e̸", "f": "f̸", "g": "g̸", "h": "h̸", "i": "i̸", "j": "j̸", "k": "k̸", "l": "l̸", "m": "m̸", "n": "n̸", "o": "o̸", "p": "p̸", "q": "q̸", "r": "r̸", "s": "s̸", "t": "t̸", "u": "u̸", "v": "v̸", "w": "w̸", "x": "x̸", "y": "y̸", "z": "z̸"
    },
    "mustache": {
    "A": "A̼", "B": "B̼", "C": "C̼", "D": "D̼", "E": "E̼", "F": "F̼", "G": "G̼", "H": "H̼", "I": "I̼", "J": "J̼", "K": "K̼", "L": "L̼", "M": "M̼", "N": "N̼", "O": "O̼", "P": "P̼", "Q": "Q̼", "R": "R̼", "S": "S̼", "T": "T̼", "U": "U̼", "V": "V̼", "W": "W̼", "X": "X̼", "Y": "Y̼", "Z": "Z̼",
    "a": "a̼", "b": "b̼", "c": "c̼", "d": "d̼", "e": "e̼", "f": "f̼", "g": "g̼", "h": "h̼", "i": "i̼", "j": "j̼", "k": "k̼", "l": "l̼", "m": "m̼", "n": "n̼", "o": "o̼", "p": "p̼", "q": "q̼", "r": "r̼", "s": "s̼", "t": "t̼", "u": "u̼", "v": "v̼", "w": "w̼", "x": "x̼", "y": "y̼", "z": "z̼"
    },
    "starrynight": {
    "A": "A͙", "B": "B͙", "C": "C͙", "D": "D͙", "E": "E͙", "F": "F͙", "G": "G͙", "H": "H͙", "I": "I͙", "J": "J͙", "K": "K͙", "L": "L͙", "M": "M͙", "N": "N͙", "O": "O͙", "P": "P͙", "Q": "Q͙", "R": "R͙", "S": "S͙", "T": "T͙", "U": "U͙", "V": "V͙", "W": "W͙", "X": "X͙", "Y": "Y͙", "Z": "Z͙",
    "a": "a͙", "b": "b͙", "c": "c͙", "d": "d͙", "e": "e͙", "f": "f͙", "g": "g͙", "h": "h͙", "i": "i͙", "j": "j͙", "k": "k͙", "l": "l͙", "m": "m͙", "n": "n͙", "o": "o͙", "p": "p͙", "q": "q͙", "r": "r͙", "s": "s͙", "t": "t͙", "u": "u͙", "v": "v͙", "w": "w͙", "x": "x͙", "y": "y͙", "z": "z͙"
    },
    "litestrikes": {
    "A": "A̶", "B": "B̶", "C": "C̶", "D": "D̶", "E": "E̶", "F": "F̶", "G": "G̶", "H": "H̶", "I": "I̶", "J": "J̶", "K": "K̶", "L": "L̶", "M": "M̶", "N": "N̶", "O": "O̶", "P": "P̶", "Q": "Q̶", "R": "R̶", "S": "S̶", "T": "T̶", "U": "U̶", "V": "V̶", "W": "W̶", "X": "X̶", "Y": "Y̶", "Z": "Z̶",
    "a": "a̶", "b": "b̶", "c": "c̶", "d": "d̶", "e": "e̶", "f": "f̶", "g": "g̶", "h": "h̶", "i": "i̶", "j": "j̶", "k": "k̶", "l": "l̶", "m": "m̶", "n": "n̶", "o": "o̶", "p": "p̶", "q": "q̶", "r": "r̶", "s": "s̶", "t": "t̶", "u": "u̶", "v": "v̶", "w": "w̶", "x": "x̶", "y": "y̶", "z": "z̶"
    },
    
    };
    
    return text.split('').map(char => fancyStyles[style][char] || char).join('');
    }
    
    function convertText() {
    const inputText = document.getElementById('inputText').value;
    const outputContainer = document.getElementById('outputContainer');
    
    // Clear previous output
    outputContainer.innerHTML = '';
    
    const styles = ['boxed', 'full_boxed', 'monospace', 'cutout', 'small_caps', 'old_english', 'old_english_bold', 'organic', 'script', 'bold_script', 'circles', 'filled_circles', 'wide', 'bold', 'bold_serif', 'italic', 'italic_serif', 'bold_italic', 'bold_italic_serif', 'underlined', 'strikeout', 'upsidedown', 'mirrored', 'supertiny', 'flag', 'zalgo', 'doubledots', 'circumflex', 'wave', 'slashed', 'mustache', 'starrynight', 'litestrikes']; // Add more styles here
    
    styles.forEach(style => {
    const div = document.createElement('div');
    div.className = 'fancy-text-container';
    
    const fancyTextResult = fancyText(inputText, style);
    div.innerHTML = `<span class="fancy-text">${fancyTextResult}</span><button class="copy-btn" onclick="copyToClipboard('${fancyTextResult}')">Copy</button>`;
    
    outputContainer.appendChild(div);
    });
    }
    
    // Function to copy text to clipboard
    function copyToClipboard(text) {
    navigator.clipboard.writeText(text)
    .then(() => {
    alert('Texto copiado para a área de transferência!');
    })
    .catch(err => {
    console.error('Erro ao copiar texto: ', err);
    alert('Erro ao copiar texto. Por favor, tente novamente.');
    });
    }
    
    // Initial display of all styles with default text
    document.addEventListener('DOMContentLoaded', () => {
    const defaultText = "Letras";
    const outputContainer = document.getElementById('outputContainer');
    
    const styles = ['boxed', 'full_boxed', 'monospace', 'cutout', 'small_caps', 'old_english', 'old_english_bold', 'organic', 'script', 'bold_script', 'circles', 'filled_circles', 'wide', 'bold', 'bold_serif','italic', 'italic_serif', 'bold_italic', 'bold_italic_serif', 'underlined', 'strikeout', 'upsidedown', 'mirrored', 'supertiny', 'flag', 'zalgo', 'doubledots', 'circumflex', 'wave', 'slashed', 'mustache', 'starrynight', 'litestrikes']; // Add more styles here
    
    styles.forEach(style => {
    const div = document.createElement('div');
    div.className = 'fancy-text-container';
    
    const fancyTextResult = fancyText(defaultText, style);
    div.innerHTML = `<span class="fancy-text">${fancyTextResult}</span><button class="copy-btn" onclick="copyToClipboard('${fancyTextResult}')">Copy</button>`;
    
    outputContainer.appendChild(div);
    });
    });